aDv4nSSer/comedero-iot-esp32/src/main_wokwi.cpp
// ═══════════════════════════════════════════════════════════════════════
// EDGE COMPUTING — CÁLCULO RER (idéntico al hardware real)
// ═══════════════════════════════════════════════════════════════════════
float calcularRacion(float porcentajeHorario) {
    if (perfil.peso_kg <= 0.0f || perfil.kcal_por_gramo <= 0.0f) return 0.0f;
    float rer = perfil.factor_rer * powf(perfil.peso_kg, 0.75f);
    return (rer / perfil.kcal_por_gramo) * porcentajeHorario;
}

void actualizarEMA(float gramosDispensados) {
    consumoEMA = (ALPHA_EMA * gramosDispensados) + ((1.0f - ALPHA_EMA) * consumoEMA);
    Serial.printf("[EMA] Consumo estimado: %.1f g/dia\n", consumoEMA);
}

// ═══════════════════════════════════════════════════════════════════════
// SERIAL — REEMPLAZO DE BLE
// ═══════════════════════════════════════════════════════════════════════

void imprimirStatus() {
    int nH = max(perfil.num_horarios, 1);
    float dias = (consumoEMA > 0.1f) ? (masaUltimaLectura / consumoEMA) : 999.0f;
    Serial.println(F("\n[STATUS] ────────────────────────────────"));
    Serial.printf("  Estado FSM:   %s\n",
        estadoActual == REPOSO      ? "REPOSO" :
        estadoActual == DISPENSANDO ? "DISPENSANDO" :
        estadoActual == ERROR       ? "ERROR" : "OTA");
    Serial.printf("  Masa tanque:  %.1f g\n",    masaUltimaLectura);
    Serial.printf("  Masa platill: %.1f g\n",    masaPlatilloActual);
    Serial.printf("  Verificacion: %s\n",        estadoVerificacion.c_str());
    Serial.printf("  Distancia US: %.1f cm\n",   distanciaUltima);
    Serial.printf("  Consumo EMA:  %.1f g/dia\n", consumoEMA);
    Serial.printf("  Dias rest.:   %.1f dias\n",  dias);
    Serial.println(F("  ── Perfil ──────────────────────────────"));
    Serial.printf("  Perro:        %s, %.1f kg\n", perfil.nombre_perro, perfil.peso_kg);
    Serial.printf("  Factor RER:   %.1f\n",        perfil.factor_rer);
    Serial.printf("  Alimento:     %s, %.2f kcal/g\n", perfil.marca_alimento, perfil.kcal_por_gramo);
    Serial.printf("  Racion/com.:  %.1f g\n",    calcularRacion(1.0f / nH));
    Serial.print(F("  Horarios:     "));
    for (int i = 0; i < perfil.num_horarios; i++) Serial.printf("%dh ", perfil.horarios[i]);
    Serial.println();
    Serial.println(F("[STATUS] ────────────────────────────────\n"));
}

void procesarComandoSerial(const String& linea) {
    Serial.println("[SERIAL] Recibido: " + linea);

    // CONFIG:nombre,peso_kg,factor_rer → simula característica BLE perfil
    if (linea.startsWith("CONFIG:")) {
        String params = linea.substring(7);
        int c1 = params.indexOf(',');
        int c2 = params.lastIndexOf(',');
        if (c1 > 0 && c2 > c1) {
            String nombre = params.substring(0, c1);
            float peso    = params.substring(c1 + 1, c2).toFloat();
            float factor  = params.substring(c2 + 1).toFloat();
            if (peso > 0.0f && factor > 0.0f) {
                strncpy(perfil.nombre_perro, nombre.c_str(), 31);
                perfil.peso_kg    = peso;
                perfil.factor_rer = factor;
                perfil.configurado = true;
                int nH = max(perfil.num_horarios, 1);
                Serial.printf("[SIM-BLE] Perfil: %s %.1fkg factor=%.1f → racion=%.1fg\n",
                              perfil.nombre_perro, perfil.peso_kg,
                              perfil.factor_rer, calcularRacion(1.0f / nH));
                publicarPerfil();
                ultimaActualizLCD = 0;
            } else {
                Serial.println("[SIM-BLE] ERROR: peso y factor > 0");
            }
        } else {
            Serial.println("[SIM-BLE] Formato: CONFIG:nombre,peso_kg,factor_rer");
        }
    }

    // ALIMENTO:marca,kcal_g → simula característica BLE alimento
    else if (linea.startsWith("ALIMENTO:")) {
        String params = linea.substring(9);
        int c = params.indexOf(',');
        if (c > 0) {
            String marca = params.substring(0, c);
            float kcal   = params.substring(c + 1).toFloat();
            if (kcal > 0.0f) {
                strncpy(perfil.marca_alimento, marca.c_str(), 31);
                perfil.kcal_por_gramo = kcal;
                Serial.printf("[SIM-BLE] Alimento: %s %.2f kcal/g\n",
                              perfil.marca_alimento, perfil.kcal_por_gramo);
                publicarPerfil();
                ultimaActualizLCD = 0;
            }
        } else {
            Serial.println("[SIM-BLE] Formato: ALIMENTO:marca,kcal_g");
        }
    }

    // DISPENSAR → simula {"cmd":"dispensar"} por BLE
    else if (linea == "DISPENSAR") {
        if (estadoActual == REPOSO && perfil.configurado) {
            iniciarDispensacion();
            Serial.printf("[SIM-BLE] Dispensando %.1fg → servo abierto\n", masaObjetivoG);
        } else {
            Serial.printf("[SIM-BLE] DISPENSAR ignorado (estado=%d)\n", estadoActual);
        }
    }

    // PLATILLO → simula que la mascota recibió alimento en el platillo (+80g)
    // En hardware real: el HX711b lee el peso real; en Wokwi no hay sensor físico
    else if (linea == "PLATILLO") {
        masaPlatilloActual += 80.0f;
        if (masaPlatilloActual > CAPACIDAD_TANQUE_G)
            masaPlatilloActual = CAPACIDAD_TANQUE_G;
        Serial.printf("[SIM] Platillo simulado: +80g → total %.1fg\n", masaPlatilloActual);
        Serial.printf("[SIM] (En hardware: HX711b en GPIO14/15 lee el platillo fisico)\n");
    }

    // OTA → simula {"cmd":"ota"} por BLE
    else if (linea == "OTA") {
        Serial.println("[SIM-OTA] Iniciando simulacion de actualizacion...");
        Serial.println("[SIM-OTA] (Hardware real: pio run -e esp32dev_ota --target upload)");
        otaSimInicio = 0;
        demoFase     = DFASE_OTA;
        estadoActual = ACTUALIZANDO_OTA;
        publicarOTA("INICIANDO");
        publicarTelemetria("OTA_INICIADO");
        lcdMostrarOTA();
    }

    // BOVEDA → fuerza efecto bóveda (atasco)
    else if (linea == "BOVEDA") {
        Serial.println("[SIM] Forzando efecto boveda...");
        forzarBoveda = true;
    }

    // STATUS → muestra telemetría completa
    else if (linea == "STATUS") {
        imprimirStatus();
    }

    else {
        Serial.println(F("[SERIAL] Comandos disponibles:"));
        Serial.println(F("  CONFIG:n,p,f | ALIMENTO:m,k | DISPENSAR"));
        Serial.println(F("  PLATILLO     | OTA          | BOVEDA | STATUS"));
    }
}

