aDv4nSSer/comedero-iot-esp32/src/main_wokwi.cpp
// ═══════════════════════════════════════════════════════════════════════
// HORARIO AUTOMÁTICO
// ═══════════════════════════════════════════════════════════════════════
bool esHoraDeDispensar() {
    if (!perfil.configurado || perfil.num_horarios == 0) return false;
    struct tm t;
    if (!getLocalTime(&t)) return false;
    if (t.tm_hour == ultimaHoraDispensada) return false;
    for (int i = 0; i < perfil.num_horarios; i++) {
        if (t.tm_hour == perfil.horarios[i] && t.tm_min == 0) {
            ultimaHoraDispensada = t.tm_hour;
            return true;
        }
    }
    return false;
}

// ═══════════════════════════════════════════════════════════════════════
// HELPER — INICIAR DISPENSACIÓN
// ═══════════════════════════════════════════════════════════════════════
void iniciarDispensacion() {
    int nH             = max(perfil.num_horarios, 1);
    masaObjetivoG      = calcularRacion(1.0f / nH);
    masaInicialG       = masaUltimaLectura;
    masaPlatilloAntes  = masaPlatilloActual;  // snapshot antes de abrir
    estadoVerificacion = "PENDIENTE";
    inicioDispensacion = millis();
    abrirCompuerta();
    estadoActual       = DISPENSANDO;
    Serial.printf("[FSM] Dispensacion: %.1fg | platillo base=%.1fg\n",
                  masaObjetivoG, masaPlatilloAntes);
    Serial.println("[SIM] Baja el slider HX711 del tanque, luego escribe 'PLATILLO'");
}

// ═══════════════════════════════════════════════════════════════════════
// FSM — MANEJADORES DE ESTADO
// ═══════════════════════════════════════════════════════════════════════

void handleReposo() {
    leerMasaG();
    leerDistanciaCm();

    if (detectarEfectoBoveda()) {
        Serial.println("[FSM] Efecto boveda → ERROR");
        alertaAtasco();
        demoFase = DFASE_BOVEDA;
        publicarAlerta("EFECTO_BOVEDA");
        publicarTelemetria("EFECTO_BOVEDA");
        lcdMostrarError("Atasco detectado");
        estadoActual = ERROR;
        return;
    }

    if (esHoraDeDispensar()) {
        Serial.println("[FSM] Horario → DISPENSANDO");
        iniciarDispensacion();
        return;
    }

    if (millis() - ultimaAnimacion > 500) {
        ultimaAnimacion = millis();
        neoNivelInventario(masaUltimaLectura);
    }
    if (millis() - ultimaActualizLCD > 2000) {
        ultimaActualizLCD = millis();
        lcdMostrarReposo();
    }
}

void handleDispensando() {
    leerMasaG();
    leerDistanciaCm();
    leerMasaPlatilloG();

    if (detectarEfectoBoveda()) {
        cerrarCompuerta();
        alertaAtasco();
        Serial.println("[FSM] Efecto boveda durante dispensacion → ERROR");
        demoFase = DFASE_BOVEDA;
        publicarAlerta("EFECTO_BOVEDA_CRITICO");
        publicarTelemetria("EFECTO_BOVEDA_CRITICO");
        lcdMostrarError("Atasco critico!");
        estadoActual = ERROR;
        return;
    }

    float dispensado = masaInicialG - masaUltimaLectura;
    if (dispensado < 0.0f) dispensado = 0.0f;

    if (dispensado >= masaObjetivoG) {
        cerrarCompuerta();
        actualizarEMA(dispensado);

        float recibido = masaPlatilloActual - masaPlatilloAntes;
        if (recibido >= masaObjetivoG * UMBRAL_VERIF_PCT) {
            estadoVerificacion = "OK";
            Serial.printf("[FSM] Verificacion OK: platillo recibio %.1fg\n", recibido);
            demoFase = DFASE_VERIFICACION;
            publicarDispensacion(dispensado, estadoVerificacion);
            publicarTelemetria("DISPENSACION_OK");
        } else {
            estadoVerificacion = "NO_VERIFICADA";
            Serial.printf("[FSM] Verificacion FALLA: platillo %.1fg de %.1fg\n",
                          recibido > 0.0f ? recibido : 0.0f, masaObjetivoG);
            Serial.println("[SIM] Escribe 'PLATILLO' para simular que alimento llego al platillo");
            demoFase = DFASE_VERIFICACION;
            publicarDispensacion(dispensado, estadoVerificacion);
            publicarTelemetria("DISPENSACION_NO_VERIFICADA");
        }

        lcdMostrarVerificacion();
        delay(2000);
        estadoActual = REPOSO;
        return;
    }

    if (millis() - inicioDispensacion > TIMEOUT_MOTOR_MS) {
        cerrarCompuerta();
        Serial.println("[FSM] Timeout compuerta → ERROR");
        publicarTelemetria("TIMEOUT_SERVO");
        lcdMostrarError("Timeout compuerta");
        estadoActual = ERROR;
        return;
    }

    if (millis() - ultimaAnimacion > 80) {
        ultimaAnimacion = millis();
        neoGirar(0, 100, 200);
    }
    if (millis() - ultimaActualizLCD > 500) {
        ultimaActualizLCD = millis();
        lcdMostrarDispensando();
    }
}

void handleError() {
    cerrarCompuerta();

    if (millis() - ultimaAnimacion > 300) {
        ultimaAnimacion = millis();
        neoParpadeoRojo();
    }

    if (millis() - ultimaAlerta > 5000) {
        ultimaAlerta = millis();
        alertaAtasco();
    }

    static unsigned long tEntrada = 0;
    if (tEntrada == 0) tEntrada = millis();
    if (millis() - tEntrada > 10000) {
        tEntrada     = 0;
        ultimaAlerta = 0;
        estadoActual = REPOSO;
        neoApagar();
        lcd.clear();
        Serial.println("[FSM] Auto-recuperacion → REPOSO");
    }
}

// OTA simulado con millis() — barra de progreso azul 8 segundos
void handleActualizandoOTA() {
    if (otaSimInicio == 0) {
        otaSimInicio = millis();
        Serial.println("[SIM-OTA] Descargando firmware... (8 segundos)");
    }

    unsigned long elapsed = millis() - otaSimInicio;
    int pct = (int)min((elapsed * 100UL) / 8000UL, 100UL);

    int ledsActivos = (pct * NUM_PIXELS) / 100;
    anillo.clear();
    for (int i = 0; i < ledsActivos && i < NUM_PIXELS; i++)
        anillo.setPixelColor(i, anillo.Color(0, 0, 200));
    anillo.show();

    static unsigned long ultimoOtaLCD = 0;
    if (millis() - ultimoOtaLCD > 250) {
        ultimoOtaLCD = millis();
        lcd.setCursor(0, 2);
        char buf[21];
        snprintf(buf, sizeof(buf), "Progreso: %3d%%      ", pct);
        lcd.print(buf);
        Serial.printf("[SIM-OTA] %d%%\r", pct);
    }

    if (pct >= 100) {
        Serial.println("\n[SIM-OTA] Actualizacion completada! → v4.2");
        publicarOTA("COMPLETADO");
        publicarTelemetria("OTA_COMPLETADO");
        neoColorSolido(0, 200, 0);
        lcd.clear();
        lcd.setCursor(0, 0); lcd.print("  OTA completado!  ");
        lcd.setCursor(0, 1); lcd.print("  Firmware v4.2    ");
        lcd.setCursor(0, 2); lcd.print("  (simulacion)     ");
        lcd.setCursor(0, 3); lcd.print("  Volviendo...     ");
        delay(2000);
        otaSimInicio = 0;
        demoFase     = DFASE_REPOSO;
        estadoActual = REPOSO;
        lcd.clear();
        neoApagar();
    }
}

