aDv4nSSer/comedero-iot-esp32/src/main_wokwi.cpp
// ═══════════════════════════════════════════════════════════════════════
// DEMO AUTOMÁTICA — ciclo 95s para presentación
// ═══════════════════════════════════════════════════════════════════════
void ejecutarDemo() {
    if (demoInicio == 0) demoInicio = millis();
    unsigned long t = millis() - demoInicio;

    // FASE 1 — 10s: Simula BLE cambio perfil Senior
    if (t >= 10000 && t < 10100) {
        strncpy(perfil.nombre_perro, "Rex", 31);
        perfil.peso_kg    = 18.0;
        perfil.factor_rer = 70.0;
        perfil.configurado = true;
        demoFase = DFASE_BLE_PERFIL;
        Serial.println(">>> [BLE] Perfil: Rex Senior 18kg factor=70");
        publicarPerfil();
    }

    // FASE 2 — 20s: Simula BLE cambio alimento
    if (t >= 20000 && t < 20100) {
        strncpy(perfil.marca_alimento, "Hills Senior", 31);
        perfil.kcal_por_gramo = 3.2;
        demoFase = DFASE_BLE_ALIMENTO;
        Serial.println(">>> [BLE] Alimento: Hills Senior 3.2kcal/g");
        publicarPerfil();
    }

    // FASE 3 — 30s: Auto dispensar
    if (t >= 30000 && t < 30100) {
        if (estadoActual == REPOSO && perfil.configurado) {
            demoFase = DFASE_DISPENSANDO;
            Serial.println(">>> [AUTO] Dispensacion iniciada por horario");
            iniciarDispensacion();
        }
    }

    // FASE 4 — 30-45s: Bajar masa tanque gradualmente
    if (t >= 30000 && t < 45000 && estadoActual == DISPENSANDO) {
        static unsigned long ultimaBajada = 0;
        if (millis() - ultimaBajada > 400) {
            ultimaBajada = millis();
            masaUltimaLectura = max(0.0f, masaUltimaLectura - 6.0f);
        }
    }

    // FASE 5 — 45s: Platillo recibe alimento
    if (t >= 45000 && t < 45100) {
        masaPlatilloActual += 85.0;
        demoFase = DFASE_VERIFICACION;
        Serial.println(">>> [SENSOR] Platillo: +85g recibidos");
    }

    // FASE 6 — 65s: Efecto Boveda (fusion sensorial)
    if (t >= 65000 && t < 65100) {
        if (estadoActual == REPOSO) {
            distanciaUltima   = 25.0;
            masaUltimaLectura = 400.0;
            demoFase = DFASE_BOVEDA;
            Serial.println(">>> [FUSION] HC-SR04=25cm + HX711=400g = BOVEDA!");
        }
    }

    // FASE 7 — 80s: Simula OTA
    if (t >= 80000 && t < 80100) {
        if (estadoActual == REPOSO || estadoActual == ERROR) {
            demoFase     = DFASE_OTA;
            Serial.println(">>> [OTA] Nueva version disponible, actualizando...");
            estadoActual = ACTUALIZANDO_OTA;
            otaSimInicio = millis();
            publicarOTA("INICIANDO");
            publicarTelemetria("OTA_INICIADO");
            lcdMostrarOTA();
        }
    }

    // FASE 8 — 95s: Reset y nuevo ciclo
    if (t >= 95000) {
        demoInicio         = millis();
        masaUltimaLectura  = 750.0;
        masaPlatilloActual = 0.0;
        distanciaUltima    = 5.0;
        demoFase           = DFASE_REPOSO;
        estadoActual       = REPOSO;
        lcd.clear();
        Serial.println(">>> [DEMO] Ciclo completo - reiniciando en 3s");
        delay(3000);
    }
}

// ═══════════════════════════════════════════════════════════════════════
// SETUP
// ═══════════════════════════════════════════════════════════════════════
void setup() {
    Serial.begin(115200);
    delay(500);
    Serial.println(F("\n╔════════════════════════════╗"));
    Serial.println(F("║  Comedero IoT v4.1-SIM     ║"));
    Serial.println(F("║  Servo + Buzzer + Platillo  ║"));
    Serial.println(F("╚════════════════════════════╝"));
    Serial.println(F("\nComandos Serial:"));
    Serial.println(F("  CONFIG:n,p,f | ALIMENTO:m,k"));
    Serial.println(F("  DISPENSAR    | PLATILLO"));
    Serial.println(F("  OTA          | BOVEDA | STATUS\n"));

    // ── Pines ─────────────────────────────────────────────────────────
    pinMode(PIN_TRIG,     OUTPUT);
    pinMode(PIN_ECHO,     INPUT);
    pinMode(PIN_BUZZER,   OUTPUT);
    pinMode(PIN_VIBRADOR, OUTPUT);  // definido aunque Wokwi no lo renderiza

    // ── Servo compuerta ───────────────────────────────────────────────
    compuerta.setPeriodHertz(50);
    compuerta.attach(PIN_SERVO, 500, 2400);
    cerrarCompuerta();

    // ── LCD I2C ───────────────────────────────────────────────────────
    Wire.begin(PIN_SDA, PIN_SCL);
    lcd.init();
    lcd.backlight();
    lcdMostrarBienvenida();

    // ── NeoPixel ──────────────────────────────────────────────────────
    anillo.begin();
    anillo.setBrightness(BRILLO);
    neoColorSolido(0, 50, 0);
    delay(800);

    // ── HX711 tanque + HX711b platillo ───────────────────────────────
    balanza.begin(PIN_HX711_DT, PIN_HX711_SCK);
    balanza2.begin(PIN_HX711_DT2, PIN_HX711_SCK2);

    Serial.printf("[SIM] Perfil demo: %s %.1fkg | %s %.2fkcal/g\n",
                  perfil.nombre_perro, perfil.peso_kg,
                  perfil.marca_alimento, perfil.kcal_por_gramo);

    // ── WiFi Wokwi-GUEST ──────────────────────────────────────────────
    Serial.print("[WiFi] Conectando a Wokwi-GUEST");
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    int intentos = 0;
    while (WiFi.status() != WL_CONNECTED && intentos < 40) {
        delay(500); Serial.print("."); intentos++;
    }
    if (WiFi.status() == WL_CONNECTED) {
        Serial.printf("\n[WiFi] Conectado — IP: %s\n", WiFi.localIP().toString().c_str());
        configTime(GMT_OFFSET, DAYLIGHT_SEC, NTP_SERVER);
        delay(2000);
        conectarMQTT();
    } else {
        Serial.println(F("\n[WiFi] Sin conexion"));
    }

    Serial.println(F("[SETUP] Sistema listo — escribe comandos en Serial Monitor\n"));
    lcd.clear();
}

// ═══════════════════════════════════════════════════════════════════════
// LOOP
// ═══════════════════════════════════════════════════════════════════════
void loop() {
    leerComandoSerial();

    if (!mqtt.connected()) conectarMQTT();
    mqtt.loop();

    ejecutarDemo();

    switch (estadoActual) {
        case REPOSO:           handleReposo();          break;
        case DISPENSANDO:      handleDispensando();     break;
        case ERROR:            handleError();           break;
        case ACTUALIZANDO_OTA: handleActualizandoOTA(); break;
    }

    if (millis() - ultimoEnvioTelem > 10000) {
        ultimoEnvioTelem = millis();
        publicarTelemetria();
    }

    delay(50);
}
